//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
int a = 5;
int b = 7;

if(a>b) max = a;
if(a<b) max = b;
if(a>b) min = b;
if(a<b) min = a;

Console.Write("max = ");
Console.WriteLine(max);

Console.Write("min = ");
Console.WriteLine(min);
